## Brewfile
# to use: brew bundle

# set up brew casks
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "d12frosted/emacs-plus"
tap "homebrew/cask-fonts"
cask_args appdir: "/Applications"

## Mac tools
brew "tmux"
brew "reattach-to-user-namespace"
brew "bash-completion"
#brew "zsh"
brew "git"
#brew "node"
brew "sqlite"
brew "wget"
brew "ccat"
brew "fzf" 
brew "fasd"
brew "jq"
brew "ncdu"
brew "ripgrep"
brew "openssl"
brew "fd"
brew "telnet"
brew "cmake"
brew "ispell"
# TODO: add python, python3, pyenv, pyenv-virtualenv, go?

# brew cask Mac tools
cask "google-chrome"
cask "firefox"
cask "dropbox"
cask "slack"
cask "visual-studio-code"
cask "zoomus"
cask "iterm2"
cask "font-hack-nerd-font"
cask "font-fira-code"
brew "emacs-plus", args: ['HEAD', 'with-emacs-27-branch', 'with-ctags', 'with-dbus', 'with-jansson', 'with-mailutils', 'with-xwidgets']


## SRE Team tools
brew "awscli"
brew "aws-iam-authenticator"
brew "eksctl"
brew "helm"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "lefthook"
brew "terraform-docs"
brew "octant"
brew "terraform"
brew "git-extras"

# brew cask "SRE Dev Tools"
#cask "vagrant"
#cask "virtualbox"
cask "docker"
cask "typora"
